meeting/agenda/2026/07-07.org
:PROPERTIES:
:ID:       C70D043A-38C1-48FE-89FD-C3BE073F0CCD
:END:
#+title: QT4 CG Meeting 171 Agenda 2026-07-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meetings
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/06-30.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 7 July 2026.

The next meeting is planned for 14 July.

** Review of open action items [0/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-167-01: DB to write a PR for #2641, comments in CSV
+ [ ] QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
+ [ ] QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
+ [ ] QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
+ [ ] QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
+ [ ] QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
+ [ ] QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed
+ [ ] QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2638][#2638]]: 2632-6: cross-cutting consistency (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2637][#2637]]: 2632-5: refresh stale 4.0 content (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2636][#2636]]: 2632-4: logic and semantics (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2635][#2635]]: 2632-3: typos and grammar (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2634][#2634]]: 2632-2: fix broken examples in expressions.xml (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2633][#2633]]: 2632-1: fix critical bugs and DTD-validity issues (automatically generated & reviewed)
+ PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]]: 2389 Adaptive Serialization: more freedom
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2751][#2751]]: 2674 Editorial Omnibus
+ PR [[https://qt4cg.org/dashboard/#pr-2744][#2744]]: 2741 Record coercion: keep empty entries
+ PR [[https://qt4cg.org/dashboard/#pr-2731][#2731]]: 2709 Well-formed sub-documents (2nd attempt)
+ PR [[https://qt4cg.org/dashboard/#pr-2706][#2706]]: 2704 change path() output for JNodes

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2700][#2700]]: Map constructor: create map entries for items other than maps/JNodes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2692][#2692]]: Destructuring inconsistencies and questions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2639][#2639]]: XQuery 4.0: automated review, open questions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2482][#2482]]: Add a fallback function to the `bin:decode-string` function

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2768][#2768]]: 2740 Drop constructor functions from built-in records
+ PR [[https://qt4cg.org/dashboard/#pr-2767][#2767]]: 2750 Make fn:unparsed-text, ... nondeterministic
+ PR [[https://qt4cg.org/dashboard/#pr-2766][#2766]]: 2765 Destructuring let: records, array fix
+ PR [[https://qt4cg.org/dashboard/#pr-2764][#2764]]: 2763 Folds: document possibility of early exiting
+ PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]]: 2521 URIs: unify handling of fragment identifiers
+ PR [[https://qt4cg.org/dashboard/#pr-2759][#2759]]: 1506 Type declarations: Constructor functions
+ PR [[https://qt4cg.org/dashboard/#pr-2757][#2757]]: 2569 Rules for unprefixed function calls with explicit default function ns
+ PR [[https://qt4cg.org/dashboard/#pr-2756][#2756]]: 2705 fn:element-to-map-plan: numeric types
+ PR [[https://qt4cg.org/dashboard/#pr-2755][#2755]]: 2620 fn:unparsed-text: editorial issues
+ PR [[https://qt4cg.org/dashboard/#pr-2754][#2754]]: 2284 fn:csv-doc, fn:json-doc: Equivalent code, unifications
+ PR [[https://qt4cg.org/dashboard/#pr-2753][#2753]]: 2300 fn:doc: determinism rules
+ PR [[https://qt4cg.org/dashboard/#pr-2752][#2752]]: 1697 Add documentary names to callback function signatures
+ PR [[https://qt4cg.org/dashboard/#pr-2747][#2747]]: 2591 Grammar: make step?lookup valid
+ PR [[https://qt4cg.org/dashboard/#pr-2746][#2746]]: 2745 CSV parsing: delimiters
+ PR [[https://qt4cg.org/dashboard/#pr-2734][#2734]]: 2733 A step too far
+ PR [[https://qt4cg.org/dashboard/#pr-2719][#2719]]: 1234 Serialization Parameters: Indentation, Whitespace, Newlines
+ PR [[https://qt4cg.org/dashboard/#pr-2717][#2717]]: 2660 fn:matching-segments: named capture groups
+ PR [[https://qt4cg.org/dashboard/#pr-2715][#2715]]: 2653 FLWOR, member/key/value clauses: allow sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2714][#2714]]: 2219 Generalize method calls to sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2713][#2713]]: 2257 Record declarations without namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2712][#2712]]: 2702 Dynamic node tests
+ PR [[https://qt4cg.org/dashboard/#pr-2707][#2707]]: 1962 fn:map-to-element
+ PR [[https://qt4cg.org/dashboard/#pr-2698][#2698]]: 2641 Support comments in csv
+ PR [[https://qt4cg.org/dashboard/#pr-2696][#2696]]: 2695 Apply templates to maps, arrays, and JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2649][#2649]]: 2647 file:descendants: recursion, filtering
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2761][#2761]]: 2758 Add rules for visibility of named types across packages
+ PR [[https://qt4cg.org/dashboard/#pr-2739][#2739]]: 2738 XSLT - tree terminology

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

There are a lot of PRs this week. To close as many as practical, an attempt has
been made to organize them such that we start with the “easy” ones. Proposals to
change the order are, uh, in order.

+ PR [[https://qt4cg.org/dashboard/#pr-2649][#2649]]: 2647 file:descendants: recursion, filtering
+ PR [[https://qt4cg.org/dashboard/#pr-2717][#2717]]: 2660 fn:matching-segments: named capture groups
+ PR [[https://qt4cg.org/dashboard/#pr-2753][#2753]]: 2300 fn:doc: determinism rules
+ PR [[https://qt4cg.org/dashboard/#pr-2755][#2755]]: 2620 fn:unparsed-text: editorial issues
+ PR [[https://qt4cg.org/dashboard/#pr-2767][#2767]]: 2750 Make fn:unparsed-text, ... nondeterministic
+ PR [[https://qt4cg.org/dashboard/#pr-2754][#2754]]: 2284 fn:csv-doc, fn:json-doc: Equivalent code, unifications
+ PR [[https://qt4cg.org/dashboard/#pr-2756][#2756]]: 2705 fn:element-to-map-plan: numeric types
+ PR [[https://qt4cg.org/dashboard/#pr-2764][#2764]]: 2763 Folds: document possibility of early exiting
+ PR [[https://qt4cg.org/dashboard/#pr-2719][#2719]]: 1234 Serialization Parameters: Indentation, Whitespace, Newlines
+ PR [[https://qt4cg.org/dashboard/#pr-2747][#2747]]: 2591 Grammar: make step?lookup valid
+ PR [[https://qt4cg.org/dashboard/#pr-2752][#2752]]: 1697 Add documentary names to callback function signatures
+ PR [[https://qt4cg.org/dashboard/#pr-2759][#2759]]: 1506 Type declarations: Constructor functions
+ PR [[https://qt4cg.org/dashboard/#pr-2768][#2768]]: 2740 Drop constructor functions from built-in records
+ PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]]: 2521 URIs: unify handling of fragment identifiers
+ PR [[https://qt4cg.org/dashboard/#pr-2713][#2713]]: 2257 Record declarations without namespace
+ PR [[https://qt4cg.org/dashboard/#pr-2766][#2766]]: 2765 Destructuring let: records, array fix
+ PR [[https://qt4cg.org/dashboard/#pr-2707][#2707]]: 1962 fn:map-to-element
+ PR [[https://qt4cg.org/dashboard/#pr-2714][#2714]]: 2219 Generalize method calls to sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2715][#2715]]: 2653 FLWOR, member/key/value clauses: allow sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2734][#2734]]: 2733 A step too far
+ PR [[https://qt4cg.org/dashboard/#pr-2712][#2712]]: 2702 Dynamic node tests
+ PR [[https://qt4cg.org/dashboard/#pr-2757][#2757]]: 2569 Rules for unprefixed function calls with explicit default function ns
+ PR [[https://qt4cg.org/dashboard/#pr-2746][#2746]]: 2745 CSV parsing: delimiters
+ PR [[https://qt4cg.org/dashboard/#pr-2698][#2698]]: 2641 Support comments in csv
+ PR [[https://qt4cg.org/dashboard/#pr-2696][#2696]]: 2695 Apply templates to maps, arrays, and JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2761][#2761]]: 2758 Add rules for visibility of named types across packages
+ PR [[https://qt4cg.org/dashboard/#pr-2739][#2739]]: 2738 XSLT - tree terminology

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
